import numpy as np
# Начало функции mask09
def Mask03Calc45():
# Написана нами в совокупности с другими программами
# Функция вычисляет 8 масштабируемы масок 9х9 углов 45 градусов
# Инициализация
    mask09 = np.zeros((8, 3, 3))
    mask09[0, :, :] = [
        [ 3, -1,  -1, ],
        [ 3,  0,  -1, ],
        [-1, -1,  -1, ],
    ]

    mask09[1, :, :] = [
        [ 3,  3, -1, ],
        [-1,  0, -1, ],
        [-1, -1, -1, ],
    ]

    mask09[2, :, :] = [
        [-1,  3,  3, ],
        [-1,  0, -1, ],
        [-1, -1, -1, ],   
    ]

    mask09[3, :, :] = [
        [-1, -1,  3, ],
        [-1,  0,  3, ],
        [-1, -1, -1, ],
    ]

    mask09[4, :, :] = [
        [-1, -1, -1, ],
        [-1,  0,  3, ],
        [-1, -1,  3, ],
    ]

    mask09[5, :, :] = [
        [-1, -1, -1, ],
        [-1,  0, -1, ],
        [-1,  3,  3, ],
    ]

    mask09[6, :, :] = [
        [-1, -1, -1, ],
        [-1,  0, -1, ],
        [ 3,  3, -1, ],
    ]

    mask09[7, :, :] = [
        [ 1, -1, -1, ],
        [ 3,  0, -1, ],
        [ 3, -1, -1, ],
    ]

    return mask09

def Mask03Calc90():
# Написана нами в совокупности с другими программами
# Функция вычисляет 8 масштабируемых масок 9х9 углов 90 градусов
# Инициализация
    mask09 = np.zeros((8, 3, 3))

    mask09[0, :, :] = [
        [ 3,  1,  -1, ],
        [ 1,  0,  -1, ],
        [-1, -1,  -1, ],
    ]

    mask09[1, :, :] = [
        [ 1,  3,  1, ],
        [-1,  0, -1, ],
        [-1, -1, -1, ],
    ]

    mask09[2, :, :] = [
        [-1,  1,   3, ],
        [-1,  0,   1, ],
        [-1, -1,  -1, ],   
    ]

    mask09[3, :, :] = [
        [-1, -1,  1, ],
        [-1,  0,  3, ],
        [-1, -1,  1, ],
    ]

    mask09[4, :, :] = [
        [-1, -1, -1, ],
        [-1,  0,  1, ],
        [-1,  1,  3, ],
    ]

    mask09[5, :, :] = [
        [-1, -1, -1, ],
        [-1,  0, -1, ],
        [ 1,  3,  1, ],
    ]

    mask09[6, :, :] = [
        [-1, -1, -1, ],
        [ 1,  0, -1, ],
        [ 3,  1, -1, ],
    ]

    mask09[7, :, :] = [
        [ 1, -1, -1, ],
        [ 3,  0, -1, ],
        [ 1, -1, -1, ],
    ]

    return mask09
